/*----------------------------------------------------
 * 作者:陈小会
 * 创建时间:2015/12/18
 * 描述：学生综合测评详情
 * ------------------修改记录-------------------------
 * 修改人      修改日期        修改目的
 ------------------------------------------------------*/

define(function (require) {
    var $ = require('jquery'),
        bootstrap = require('bootstrap'), //bootstrap插件
        ordermeritlinechart = require('ordermeritlinechart');//等第测评折表图表

    //默认参数设置
    var dom = '';

    //学习态度 
    var attitudeData =null//测评数据
    
    //人格品质
    var traitDate = null;//测评数据

    //获取综合等第数据
    var getAttitudeData = function () {
        return {
            Categories: ['2014/1', '2014/2', '2014/3', '2014/4', '2014/5', '2014/6', '2014/7', '2014/8', '2014/9', '2014/10', '2014/11', '2014/12', '2015/1', '2015/2', '2015/3', '2015/4', '2015/5', '2015/6', '2015/7', '2015/8', '2015/9', '2015/10', '2015/11', '2015/12', '2015/1', '2015/2', '2015/3', '2015/4', '2015/5', '2015/6', '2015/7', '2015/8', '2015/9', '2015/10', '2015/11', '2015/12', '2016/1', '2016/2', '2016/3', '2016/4', '2016/5', '2016/6', '2016/7', '2016/8', '2016/9', '2016/10', '2016/11', '2016/12'],
            SeriesData: [{ name: '遵守纪律', data: [150, 80, 100, 0, 150, 60, 85, 44, 88, 110, 105, 30, 49, 80, 55.6, 25, 55, 89, 45, 105, 120, 100, 40, 30, 55, 66, 23, 44, 66, 80, 110, 89, 97, 55, 130, 22, 56, 88, 108, 40, 150, 80, 100, 0, 150, 80, 100, 0] },
                         { name: '诚信学习', data: [120, 0, 50, 60, 120, 0, 50, 60, 120, 0, 50, 60, 120, 0, 50, 60, 120, 0, 50, 60, 120, 0, 50, 60, 120, 0, 50, 60, 120, 0, 50, 60, 120, 0, 50, 60, 150, 80, 110, 0, 150, 80, 110, 0, 150, 90, 100, 0] }],
            monthCount:47//总月数
        };
    };
    
    //获取人格品质等第数据
    var getQualityData = function () {
        return {
            Categories: ['2014/1', '2014/2', '2014/3', '2014/4', '2014/5', '2014/6', '2014/7', '2014/8', '2014/9', '2014/10', '2014/11', '2014/12', '2015/1', '2015/2', '2015/3', '2015/4', '2015/5', '2015/6', '2015/7', '2015/8', '2015/9', '2015/10', '2015/11', '2015/12', '2015/1', '2015/2', '2015/3', '2015/4', '2015/5', '2015/6', '2015/7', '2015/8', '2015/9', '2015/10', '2015/11', '2015/12', '2016/1', '2016/2', '2016/3', '2016/4', '2016/5', '2016/6', '2016/7', '2016/8', '2016/9', '2016/10', '2016/11', '2016/12'],
            SeriesData: [{ name: '文明礼貌', data: [110, 80, 100, 0, 140, 50, 75, 44, 68, 110, 85, 30, 49, 50, 55.6, 25, 55, 30, 45, 55, 20, 66, 40, 30, 35, 66, 23, 44, 66, 80, 50, 35, 89, 50, 44, 55, 89, 78, 23, 89, 79, 45, 96, 0, 89, 56, 86, 0] },
                         { name: '集体意识', data: [100, 0, 50, 60, 120, 0, 30, 50, 45, 0, 78, 50, 88, 80, 45, 55, 35, 0, 89, 88, 89, 0, 68, 58, 130, 0, 50, 60, 11, 55, 44, 89, 140, 450, 89, 8, 7, 55, 33, 0, 22, 88, 88, 0, 35, 45, 35, 0] }],
            monthCount: 47//总月数
        };
    };

    //等第运算
    var orderMeritList = [{ 'minScore': 0, 'maxScore': 60, 'meritName': 'E' }, { 'minScore': 60, 'maxScore': 70, 'meritName': 'D' }, { 'minScore': 70, 'maxScore': 80, 'meritName': 'C' }, { 'minScore': 80, 'maxScore': 90, 'meritName': 'B' }, { 'minScore': 90, 'maxScore': 100, 'meritName': 'A' }, { 'minScore': 100, 'maxScore': 150, 'meritName': 'A+' }];//等第列表

    //初始化测评
    var init = function () {
        //初始化德参数
        attitudeData = getAttitudeData();//学习态度-测评数据
        dom = 'attitudeContainer';//学习态度-容器
        ordermeritlinechart(dom, attitudeData, orderMeritList);//初始化学习态度-图表
        
        traitData = getQualityData();//人格品质-测评数据
        dom = 'traitContainer';//人格品质-容器
        ordermeritlinechart(dom, traitData, orderMeritList);//初始化人格品质-图表
    };
    
    init();//初始化综合测评
});