/*----------------------------------------------------
 * 作者:陈小会
 * 创建时间:2015/12/26
 * 描述："智"综合测评 
 * ------------------修改记录-------------------------
 * 修改人      修改日期        修改目的
 ------------------------------------------------------*/
define(function(require) {
    var $ = require('jquery'),
        bootstrap = require('bootstrap'), //bootstrap插件
        studymixevaluation = require('studymixevaluation'),//学习情况复杂图形测评
        ordermeritlinechart = require('ordermeritlinechart');//等第测评折表图表

    //默认参数设置
    var attitudeDom = '';

    //学习态度 
    var attitudeDef = null//测评数据

    //获取综合等第数据
    var getComprehensiveData = function () {
        return {
            Categories: ['2014/1', '2014/2', '2014/3', '2014/4', '2014/5', '2014/6', '2014/7', '2014/8', '2014/9', '2014/10', '2014/11', '2014/12', '2015/1', '2015/2', '2015/3', '2015/4', '2015/5', '2015/6', '2015/7', '2015/8', '2015/9', '2015/10', '2015/11', '2015/12', '2015/1', '2015/2', '2015/3', '2015/4', '2015/5', '2015/6', '2015/7', '2015/8', '2015/9', '2015/10', '2015/11', '2015/12', '2016/1', '2016/2', '2016/3', '2016/4', '2016/5', '2016/6', '2016/7', '2016/8', '2016/9', '2016/10', '2016/11', '2016/12'],
            SeriesData: [{ name: '遵守纪律', data: [150, 80, 100, 0, 150, 60, 85, 44, 88, 110, 105, 30, 49, 80, 55.6, 25, 55, 89, 45, 105, 120, 100, 40, 30, 55, 66, 23, 44, 66, 80, 110, 89, 97, 55, 130, 22, 56, 88, 108, 40, 150, 80, 100, 0, 150, 80, 100, 0] },
                         { name: '诚信学习', data: [120, 0, 50, 60, 120, 0, 50, 60, 120, 0, 50, 60, 120, 0, 50, 60, 120, 0, 50, 60, 120, 0, 50, 60, 120, 0, 50, 60, 120, 0, 50, 60, 120, 0, 50, 60, 150, 80, 110, 0, 150, 80, 110, 0, 150, 90, 100, 0] }],
            monthCount: 47//总月数
        };
    };

    //获取综合等第数据
    var getWisdomData = function () {
        return {
            Categories: ['2014/1', '2014/2', '2014/3', '2014/4', '2014/5', '2014/6', '2014/7', '2014/8', '2014/9', '2014/10', '2014/11', '2014/12', '2015/1', '2015/2', '2015/3', '2015/4', '2015/5', '2015/6', '2015/7', '2015/8', '2015/9', '2015/10', '2015/11', '2015/12', '2015/1', '2015/2', '2015/3', '2015/4', '2015/5', '2015/6', '2015/7', '2015/8', '2015/9', '2015/10', '2015/11', '2015/12', '2016/1', '2016/2', '2016/3', '2016/4', '2016/5', '2016/6', '2016/7', '2016/8', '2016/9', '2016/10', '2016/11', '2016/12'],
            SeriesData: [{ name: '作业量', data: [150, 80, 100, 0, 150, 60, 85, 44, 88, 110, 105, 30, 49, 80, 55.6, 25, 55, 89, 45, 105, 120, 100, 40, 30, 55, 66, 23, 44, 66, 80, 110, 89, 97, 55, 130, 22, 56, 88, 108, 40, 150, 80, 100, 0, 150, 80, 100, 0] },
                         { name: '完成率', data: [100, 0, 50, 60, 100, 0, 50, 60, 100, 0, 50, 60, 120, 0, 50, 60, 100, 0, 50, 60, 120, 0, 50, 60, 50, 0, 50, 60, 80, 0, 50, 60, 70, 0, 50, 60, 50, 80, 40, 0, 30, 80, 20, 0, 10, 90, 100, 0] }],
            SeriesData2: [{ name: '考试量', data: [150, 80, 100, 0, 150, 60, 85, 44, 88, 110, 105, 30, 49, 80, 55.6, 25, 55, 89, 45, 105, 120, 100, 40, 30, 55, 66, 23, 44, 66, 80, 110, 89, 97, 55, 130, 22, 56, 88, 108, 40, 150, 80, 100, 0, 150, 80, 100, 0] },
                        { name: '完成率', data: [120, 0, 50, 60, 33, 0, 50, 60, 120, 0, 50, 60, 120, 0, 50, 60, 33, 0, 50, 60, 23, 0, 50, 60, 120, 0, 50, 60, 44, 0, 50, 60, 66, 0, 50, 60, 22, 80, 88, 0, 25, 80, 110, 0, 45, 90, 100, 0] }],
            monthCount: 47//总月数
        };
    };
    
    //等第运算
    var orderMeritList = [{ 'minScore': 0, 'maxScore': 60, 'meritName': 'E' }, { 'minScore': 60, 'maxScore': 70, 'meritName': 'D' }, { 'minScore': 70, 'maxScore': 80, 'meritName': 'C' }, { 'minScore': 80, 'maxScore': 90, 'meritName': 'B' }, { 'minScore': 90, 'maxScore': 100, 'meritName': 'A' }, { 'minScore': 100, 'maxScore': 150, 'meritName': 'A+' }];//等第列表

    //学习情况数据  
    var studyData = null;//测评数据

    //学习情况dom 
    var studyDom = {
        containerId1: 'homeworkContainer',//学习情况-作业容器
        containerId2: 'examContainer'//学习情况-考试容器
    };

    //初始化测评
    var init = function () {
        //初始化智-学习态度参数
        attitudeData = getComprehensiveData();//学习态度-测评数据
        attitudeDom = 'attitudeContainer';//学习态度-容器
        ordermeritlinechart(attitudeDom, attitudeData, orderMeritList);//初始化学习态度-图表

        //初始化学习情况
        studyData = getWisdomData();//学习情况-测评数据
        studymixevaluation(studyDom, studyData);//初始化学习情况-图表
    };

    init();//初始化测评
});